## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-05-08T16:18:24.476+0000" -> "2023-05-08T16:18:36.160+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadFFISSpreadsheet"
        name      = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "s3:PutObject"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis/download.xlsx"
                        Sid      = "AllowS3DownloadWrite"
                    },
                  ~ {
                      ~ Action   = "sqs:ReceiveMessage" -> [
+                           "sqs:ReceiveMessage",
+                           "sqs:GetQueueAttributes",
+                           "sqs:DeleteMessage",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_event_source_mapping.this["sqs"] will be created
+   resource "aws_lambda_event_source_mapping" "this" {
+       batch_size                         = 1
+       enabled                            = true
+       event_source_arn                   = "arn:aws:sqs:us-west-2:357150818708:ffis_downloads"
+       function_arn                       = (known after apply)
+       function_name                      = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet"
+       id                                 = (known after apply)
+       last_modified                      = (known after apply)
+       last_processing_result             = (known after apply)
+       maximum_batching_window_in_seconds = 20
+       maximum_record_age_in_seconds      = (known after apply)
+       maximum_retry_attempts             = (known after apply)
+       parallelization_factor             = (known after apply)
+       state                              = (known after apply)
+       state_transition_reason            = (known after apply)
+       uuid                               = (known after apply)

+       amazon_managed_kafka_event_source_config {
+           consumer_group_id = (known after apply)
        }

+       self_managed_kafka_event_source_config {
+           consumer_group_id = (known after apply)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-05-08T16:18:36.160+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/1da9e7a7a700327453a123162f9b15ace0c40f9cc660d1d656422fb3aa2cfda8.zip" -> "builds/90b599c8f5355863a6805b1c08f0932bb6839792ec9940ffab329d2e0a445d25.zip"
      ~ s3_object_version              = "oF3RewydouYrqpY0K.ccfNZlr.h.F_B0" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:2801783240a60d2a4b3884ef6113aaf6ce7a34b2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:bd8553db5d0f25cff541feb90ccfb3e52cd08c7e,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "2801783240a60d2a4b3884ef6113aaf6ce7a34b2" -> "bd8553db5d0f25cff541feb90ccfb3e52cd08c7e"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       id                  = (known after apply)
+       principal           = ".amazonaws.com"
+       qualifier           = (known after apply)
+       statement_id        = "SQSQueueNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["SQSQueueNotification"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       id                  = (known after apply)
+       principal           = ".amazonaws.com"
+       statement_id        = "SQSQueueNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4ccc8798c6b63dd014a32626478b5d26-2" -> (known after apply)
      ~ id                     = "builds/1da9e7a7a700327453a123162f9b15ace0c40f9cc660d1d656422fb3aa2cfda8.zip" -> (known after apply)
      ~ key                    = "builds/1da9e7a7a700327453a123162f9b15ace0c40f9cc660d1d656422fb3aa2cfda8.zip" -> "builds/90b599c8f5355863a6805b1c08f0932bb6839792ec9940ffab329d2e0a445d25.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/1da9e7a7a700327453a123162f9b15ace0c40f9cc660d1d656422fb3aa2cfda8.zip" -> "builds/90b599c8f5355863a6805b1c08f0932bb6839792ec9940ffab329d2e0a445d25.zip"
-       tags                   = {} -> null
      ~ version_id             = "oF3RewydouYrqpY0K.ccfNZlr.h.F_B0" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/90b599c8f5355863a6805b1c08f0932bb6839792ec9940ffab329d2e0a445d25.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/90b599c8f5355863a6805b1c08f0932bb6839792ec9940ffab329d2e0a445d25.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7785114188814818700" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1da9e7a7a700327453a123162f9b15ace0c40f9cc660d1d656422fb3aa2cfda8.zip" -> "builds/90b599c8f5355863a6805b1c08f0932bb6839792ec9940ffab329d2e0a445d25.zip"
          ~ "timestamp" = "1683562468788467800" -> "1683563447257386000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2117661469325452744" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/1da9e7a7a700327453a123162f9b15ace0c40f9cc660d1d656422fb3aa2cfda8.zip" -> "builds/90b599c8f5355863a6805b1c08f0932bb6839792ec9940ffab329d2e0a445d25.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-05-08T16:18:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:26" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:26/invocations" -> (known after apply)
      ~ s3_key                         = "builds/02813636b1ff3e50668e7fcf34f8e734066dd283c02ebfd8fc14daef89ff1c23.zip" -> "builds/526d0c83213082fe7bfd666e2d0ca1106b11cea4ad58583f2c6566b11bce27b6.zip"
      ~ s3_object_version              = "4TFCTJohkHKHPljqUB4a5xo3qUj1T1Ab" -> (known after apply)
        tags                           = {}
      ~ version                        = "26" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:2801783240a60d2a4b3884ef6113aaf6ce7a34b2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:bd8553db5d0f25cff541feb90ccfb3e52cd08c7e,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "2801783240a60d2a4b3884ef6113aaf6ce7a34b2" -> "bd8553db5d0f25cff541feb90ccfb3e52cd08c7e"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "26" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4d2f1f7ca440dd9ca6b066acbb1445af-2" -> (known after apply)
      ~ id                     = "builds/02813636b1ff3e50668e7fcf34f8e734066dd283c02ebfd8fc14daef89ff1c23.zip" -> (known after apply)
      ~ key                    = "builds/02813636b1ff3e50668e7fcf34f8e734066dd283c02ebfd8fc14daef89ff1c23.zip" -> "builds/526d0c83213082fe7bfd666e2d0ca1106b11cea4ad58583f2c6566b11bce27b6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/02813636b1ff3e50668e7fcf34f8e734066dd283c02ebfd8fc14daef89ff1c23.zip" -> "builds/526d0c83213082fe7bfd666e2d0ca1106b11cea4ad58583f2c6566b11bce27b6.zip"
-       tags                   = {} -> null
      ~ version_id             = "4TFCTJohkHKHPljqUB4a5xo3qUj1T1Ab" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/526d0c83213082fe7bfd666e2d0ca1106b11cea4ad58583f2c6566b11bce27b6.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/526d0c83213082fe7bfd666e2d0ca1106b11cea4ad58583f2c6566b11bce27b6.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "535185396951966878" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/02813636b1ff3e50668e7fcf34f8e734066dd283c02ebfd8fc14daef89ff1c23.zip" -> "builds/526d0c83213082fe7bfd666e2d0ca1106b11cea4ad58583f2c6566b11bce27b6.zip"
          ~ "timestamp" = "1683562455481841000" -> "1683563432808781000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8182309787464211649" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/02813636b1ff3e50668e7fcf34f8e734066dd283c02ebfd8fc14daef89ff1c23.zip" -> "builds/526d0c83213082fe7bfd666e2d0ca1106b11cea4ad58583f2c6566b11bce27b6.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-05-08T16:18:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:6/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9615252e78a4e099c708a77b82396325dd9f19a2ca03a70c6df34c20cc04a6c2.zip" -> "builds/4bbe0acc93cb5416cd45392441a0ac3c3920ffbd154c3a2cee9cb4115f8cd3d5.zip"
      ~ s3_object_version              = "wjTd6rNxaom.v9Dqh.5pJ73PvrxhwYBX" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:2801783240a60d2a4b3884ef6113aaf6ce7a34b2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:bd8553db5d0f25cff541feb90ccfb3e52cd08c7e,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "2801783240a60d2a4b3884ef6113aaf6ce7a34b2" -> "bd8553db5d0f25cff541feb90ccfb3e52cd08c7e"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1da707ca6bd1dae5264876c2596c6bd0-2" -> (known after apply)
      ~ id                     = "builds/9615252e78a4e099c708a77b82396325dd9f19a2ca03a70c6df34c20cc04a6c2.zip" -> (known after apply)
      ~ key                    = "builds/9615252e78a4e099c708a77b82396325dd9f19a2ca03a70c6df34c20cc04a6c2.zip" -> "builds/4bbe0acc93cb5416cd45392441a0ac3c3920ffbd154c3a2cee9cb4115f8cd3d5.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9615252e78a4e099c708a77b82396325dd9f19a2ca03a70c6df34c20cc04a6c2.zip" -> "builds/4bbe0acc93cb5416cd45392441a0ac3c3920ffbd154c3a2cee9cb4115f8cd3d5.zip"
-       tags                   = {} -> null
      ~ version_id             = "wjTd6rNxaom.v9Dqh.5pJ73PvrxhwYBX" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/4bbe0acc93cb5416cd45392441a0ac3c3920ffbd154c3a2cee9cb4115f8cd3d5.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/4bbe0acc93cb5416cd45392441a0ac3c3920ffbd154c3a2cee9cb4115f8cd3d5.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4850455413104216791" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9615252e78a4e099c708a77b82396325dd9f19a2ca03a70c6df34c20cc04a6c2.zip" -> "builds/4bbe0acc93cb5416cd45392441a0ac3c3920ffbd154c3a2cee9cb4115f8cd3d5.zip"
          ~ "timestamp" = "1683562468914835000" -> "1683563447280666200"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8623843356810105942" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9615252e78a4e099c708a77b82396325dd9f19a2ca03a70c6df34c20cc04a6c2.zip" -> "builds/4bbe0acc93cb5416cd45392441a0ac3c3920ffbd154c3a2cee9cb4115f8cd3d5.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-08T16:18:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:25" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:25/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9365e8951c0d3fb2b0100209f0806484d601308e80f2f705d13db27f7a892ee8.zip" -> "builds/6d54d2dfea223196b61f40fa67ff475de30e5c1f6ac4b584a248acaefb1d236e.zip"
      ~ s3_object_version              = "SxxQktj42cGhxOnnJrNUuo3fQOY0uFj8" -> (known after apply)
        tags                           = {}
      ~ version                        = "25" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:2801783240a60d2a4b3884ef6113aaf6ce7a34b2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:bd8553db5d0f25cff541feb90ccfb3e52cd08c7e,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "2801783240a60d2a4b3884ef6113aaf6ce7a34b2" -> "bd8553db5d0f25cff541feb90ccfb3e52cd08c7e"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "25" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2e04170e17c01b777a14879409b53acc-2" -> (known after apply)
      ~ id                     = "builds/9365e8951c0d3fb2b0100209f0806484d601308e80f2f705d13db27f7a892ee8.zip" -> (known after apply)
      ~ key                    = "builds/9365e8951c0d3fb2b0100209f0806484d601308e80f2f705d13db27f7a892ee8.zip" -> "builds/6d54d2dfea223196b61f40fa67ff475de30e5c1f6ac4b584a248acaefb1d236e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9365e8951c0d3fb2b0100209f0806484d601308e80f2f705d13db27f7a892ee8.zip" -> "builds/6d54d2dfea223196b61f40fa67ff475de30e5c1f6ac4b584a248acaefb1d236e.zip"
-       tags                   = {} -> null
      ~ version_id             = "SxxQktj42cGhxOnnJrNUuo3fQOY0uFj8" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/6d54d2dfea223196b61f40fa67ff475de30e5c1f6ac4b584a248acaefb1d236e.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/6d54d2dfea223196b61f40fa67ff475de30e5c1f6ac4b584a248acaefb1d236e.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2222013287269245300" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9365e8951c0d3fb2b0100209f0806484d601308e80f2f705d13db27f7a892ee8.zip" -> "builds/6d54d2dfea223196b61f40fa67ff475de30e5c1f6ac4b584a248acaefb1d236e.zip"
          ~ "timestamp" = "1683562455242240000" -> "1683563432761705000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5617605690363325356" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9365e8951c0d3fb2b0100209f0806484d601308e80f2f705d13db27f7a892ee8.zip" -> "builds/6d54d2dfea223196b61f40fa67ff475de30e5c1f6ac4b584a248acaefb1d236e.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 22 to add, 9 to change, 15 to destroy.
```

</details>

*Pusher: @jakekreider, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4917366986)*